Repository: KnowldegeWork01/FTBT
Catalog: Backend/uploads/1718856842046-For xbench.xlsx.tmx
Source language: en_us
Languages: kn

source: Assemble bearing (a) and oil seal (b) in lower crankcase (c) on the LH side (magneto side)
kn: ಬೇರಿಂಗ್ (a) ಮತ್ತು ತೈಲ ಸೀಲ್ (b) ಅನ್ನು ಕ್ರಾಂಕ್‌ಕೇಸ್ (c) ಒಳಗೆ ಲೆಫ್ಟ್ ಹ್ಯಾಂಡ್ (LH) ಸೈಡ್‌ನಲ್ಲಿ (ಮ್ಯಾಗ್ನೆಟೊ ಸೈಡ್) ಸ್ಥಾಪಿಸಿ.

source: Assemble circlip (a) on the shifter shaft at the LH side and ensure it is correctly seated and locked in the groove on the shifter shaft.
kn: ಎಡಭಾಗದ ಶಿಫ್ಟರ್ ಶಾಫ್ಟ್ ಮೇಲೆ ಸರ್ಕ್ಲಿಪ್ (a) ಅನ್ನು ಜೊತೆಗಿಸಿ ಮತ್ತು ಅದನ್ನು ಶಿಫ್ಟರ್ ಶಾಫ್ಟ್ ಗೊಂದಲದಲ್ಲಿ ಸರಿಯಾಗಿ ಕೂರಿಸಿ ಮತ್ತು ಲಾಕ್ಡ್ ಆಗಿರುವುದನ್ನು ಖಚಿತಪಡಿಸಿ.

source: 3 mm Torx socket with Ratchet
kn: ರಾಟ್ಚೆಟ್ನೊಂದಿಗೆ 3 ಎಂಎಂ ಟಾರ್ಕ್ಸ್ ಸಾಕೆಟ್.

source: 3.1 Liters / 0.82 Imperial gallon.
kn: 3.1 ಲೀಟರ್‌ಗಳು / 0.82 ಇಂಪೀರಿಯಲ್ ಗ್ಯಾಲನ್‌ಗಳು.

source: 3.1 Liters/0.68 Imperial Gallons/0.82 US Gallons
kn: 3.1 Liters/0.68 ಇಂಪೀರಿಯಲ್ ಗ್ಯಾಲನ್‌ಗಳು/0.82 US ಗ್ಯಾಲನ್‌ಗಳು

source: 5th Gear (24 teeth)
kn: 5ನೇ ಗಿಯರ್ (24 ಹಲ್ಲುಗಳು)

source: 5th Gear (26 teeth)
kn: 5ನೇ ಗಿಯರ್ (26 ಹಲ್ಲುಗಳು)

source: 3rd Steel plate on clutch bell .
kn: - ಕ್ಲಚ್ ಬೆಲ್‌ನ ಮೇಲೆ 3ನೇ ಸ್ಟೀಲ್ ಪ್ಲೇಟ್ ಅಸೆಂಬಲ್ ಮಾಡಿ.

source: 3rd steel plate on clutch bell.
kn: - 3ನೇ ಸ್ಟೀಲ್ ಪ್ಲೇಟ್ ಅನ್ನು ಕ್ಲಚ್ ಬೆಲ್ ಮೇಲೆ ಜೋಡಿಸಿ.

source: "CAN BUS Short Circuit /
kn: CAN ಬಸ್ ಶಾರ್ಟ್ ಸರ್ಕ್ಯೂಟ್/

source: 1 during closed loop engine operation.
kn: 1 ಮುಚ್ಚಿದ ಲೂಪ್ ಎಂಜಿನ್ ಕಾರ್ಯಾಚರಣೆಯ ಸಮಯದಲ್ಲಿ

source: 10.1 Engine Management System (EMS) 605
kn: 10.1 ಇಂಜಿನ್ ಮ್ಯಾನೇಜ್ಮೆಂಟ್ ಸಿಸ್ಟಂ (EMS) 605

source: Assemble splined thrust washer (a) on counter-shaft (b) and ensure it is seated properly against circlip.
kn: ಸ್ಪ್ಲೈನ್ಡ್ ಥ್ರಸ್ಟ್ ವಾಶರ್ (a) ಅನ್ನು ಕೌಂಟರ್ ಶಾಫ್ಟ್ (b) ಮೆಲೆ ಹೊಂದಿಸಿ ಮತ್ತು ಅದು ಸರಿಯಾಗಿ ಸರ್ಕ್ಲಿಪ್ ವಿರುದ್ಧ ಆಸನ ಪಡೆದಿದೆಯೇ ಎಂದು ಖಚಿತಪಡಿಸಿ.

source: Assembly 675
kn: ಅಸೆಂಬ್ಲಿ 675

source: Assembly 394
kn: ಸಂಯೋಜನೆ 394

source: Assembly 409
kn: ಸಂಯೋಜನೆ 409

source: Assembly 542
kn: ಅಸೆಂಬ್ಲಿ 542

source: Brake - Front 543
kn: ಬ್ರೇಕ್ - ಮುಂದೆ 543

source: Brake - Front 552
kn: ಬ್ರೇಕ್‌ -ಮುಂಭಾಗ 552

source: Clutch plates movement in clutch housing is sticky
kn: ರಾಕರ್ ಶಾಫ್ಟ್ನ ಥ್ರೆಡೆಡ್ ಭಾಗಕ್ಕೆ ಒಂದು ಹೆಕ್ಸ್ ಫ್ಲಾಂಜ್ ಬೋಲ್ಟ್ (M6) (a) ಅನ್ನು ತಿರುಗಿಸಿ.

source: Clutch plates/clutch housing damaged
kn: ಕ್ಲಚ್ ಪ್ಲೇಟ್‌ಗಳು/ಕ್ಲಚ್ ಹೌಸಿಂಗ್ ಹಾನಿಯಾಗಿದೆ.

source: Check and replace clutch plates/clutch assembly
kn: ಕ್ಲಚ್ ಪ್ಲೇಟ್‌ಗಳು/ಕ್ಲಚ್ ಜೋಡಣೆಯನ್ನು ಪರಿಶೀಲಿಸಿ ಮತ್ತು ಬದಲಾಯಿಸಿ.

source: Clutch operation hard
kn: ಕ್ಲಚ್ ಕಾರ್ಯಾಚರಣೆ ಕಷ್ಟ.

source: Clutch lever movement in bracket hard
kn: ಬ್ರಾಕೆಟ್ ಗಟ್ಟಿಯಾಗಿ ಕ್ಲಚ್ ಲಿವರ್ ಚಲನೆ.

source: Inner cable movement sticky in outer cable
kn: ಒಳಗಿನ ಕೇಬಲ್ ಚಲನೆಯು ಹೊರಗಿನ ಕೇಬಲ್‌ನಲ್ಲಿ ಅಂಟಿಕೊಳ್ಳುತ್ತದೆ .
